<script setup lang="ts"></script>

<template>
  <div>
    <h1>帮助</h1>
    <p>（这份帮助是考虑到不懂电脑的人的，如果你觉得太啰嗦，并且知道具体操作的话，可以不看）</p>
    <h2>目录</h2>
    <el-anchor :offset="72">
      <el-anchor-link href="#roll">抽选操作</el-anchor-link>
      <el-anchor-link href="#import">导入名单</el-anchor-link>
      <el-anchor-link href="#settings">设置</el-anchor-link>
      <el-anchor-link href="#history">查看历史记录</el-anchor-link>
    </el-anchor>
    <h2 id="roll">抽选操作</h2>
    <p>首先点击最左侧的 <font-awesome-icon icon="fas fa-dice" /> 图标。</p>
    <p>在“操作”面板上会有一个滑动条和一个输入框，滑动条的值和输入框是一样的。</p>
    <p>选定人数时，只需要拉动滑动条，或者修改输入框的值（可以直接输入或者点击两侧的加减按钮），再点击“抽选”即可。</p>
    <p>结果揭晓后，只需要点击右下方的蓝色按钮即可。</p>
    <h2 id="import">导入名单</h2>
    <p>（Windows 系统的操作方法）</p>
    <p>首先，在电脑桌面上右键（在一体机上则是长按）打开右键菜单，然后选择“新建” -> “文本文档”，取一个你记得住的名字。</p>
    <p>然后，快速点击两次刚刚创建的文本文档（或者，叫做“双击”），将名字逐行输入进去。（至于空行和每行前后的空格就不用管了，反正导入的时候会自己处理）</p>
    <p>（按回车或 Enter 键换行）</p>
    <p>在输入完名字后，记得保存！记得保存！记得保存！可以按快捷键 Ctrl + S （按住 Ctrl 键不放然后按一下 S 键）或者在记事本中点击上面的“文件（F）”，然后点击保存。</p>
    <p>再点击最左侧的 <font-awesome-icon icon="fas fa-gear" /> 图标，找到“点击上传”按钮，点击，然后在弹出的对话框中点击“选择文件”，在左侧找到“桌面”或“Desktop”字样，点一下，然后找到你创建的文本文档的名字，点两下就可以了。</p>
    <p>名单是自动保存的，不会因关闭页面而重置。</p>
    <h2 id="settings">设置</h2>
    <p>点击最左侧的 <font-awesome-icon icon="fas fa-gear" /> 图标，可以发现分三个板块，这里一一细讲。</p>
    <p>设置是自动保存的，不会因关闭页面而重置。</p>
    <h3>外观设置</h3>
    <p>你可以点击“深色模式”开关来切换是否使用深色模式，还可以选择抽选页面中的操作面板的位置。</p>
    <h3>抽选设置</h3>
    <p>可以通过点击“播放动画”开关来决定是否播放动画，不播放的话直接显示结果，适合赶时间的情况。</p>
    <p>当然如果不赶时间，你可以通过调整动画速度和动画持续时间来实现你需要的效果，拉动滑动条就行。</p>
    <p>还有个学生名单上传按钮，上面一节已经讲过了，这里不多赘述。</p>
    <p>除此之外你还可以设置抽选页面的标题，改成什么都可以。</p>
    <h3>危险操作</h3>
    <p style="color: var(--el-color-danger)"><b>警告：这个功能仅供新班级第一次使用时使用，不要误触！不要误触！不要误触！该操作不可逆！</b></p>
    <p>点击最下面的“重置设置和学生名单”，在弹出的对话框中点击“重置吧”，即可重置设置和学生名单。</p>
    <h2 id="history">查看历史记录</h2>
    <p>可以点击左侧的 <font-awesome-icon icon="fas fa-clipboard" /> 图标查看历史记录，历史记录按时间排序，且会自动保存，不会因关闭页面而重置。</p>
    <p>你也可以点击下方的红色按钮清空历史记录。</p>
  </div>
</template>
